junggeehoon/STM32_BLDC_controller/Six_step_position/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#define RS485_TX_ENABLE() HAL_GPIO_WritePin(RS485_TX_EN_GPIO_Port, RS485_TX_EN_Pin, GPIO_PIN_SET)
#define RS485_RX_ENABLE() HAL_GPIO_WritePin(RS485_TX_EN_GPIO_Port, RS485_TX_EN_Pin, GPIO_PIN_RESET)

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define DRIVE_EN3_Pin GPIO_PIN_14
#define DRIVE_EN3_GPIO_Port GPIOC
#define FAULT_Pin GPIO_PIN_12
#define FAULT_GPIO_Port GPIOB
#define INL1_EN1_Pin GPIO_PIN_13
#define INL1_EN1_GPIO_Port GPIOB
#define INL2_EN2_Pin GPIO_PIN_14
#define INL2_EN2_GPIO_Port GPIOB
#define INL3_EN3_Pin GPIO_PIN_15
#define INL3_EN3_GPIO_Port GPIOB
#define LED_Pin GPIO_PIN_9
#define LED_GPIO_Port GPIOC
#define HALL_A_Pin GPIO_PIN_10
#define HALL_A_GPIO_Port GPIOC
#define HALL_B_Pin GPIO_PIN_11
#define HALL_B_GPIO_Port GPIOC
#define HALL_C_Pin GPIO_PIN_12
#define HALL_C_GPIO_Port GPIOC
#define RS485_TX_EN_Pin GPIO_PIN_8
#define RS485_TX_EN_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
